"""طرح ریزی اولیه پروژه"""
    
    
# ****************************************************************************************************************************************************

"""
    چیزایی که قراره حتما وجود داشته باشه:
    
        1- بخش های اصلی:
            مشتریان
            محصولات
            سفارش ها
            
        2- تعریف محصول جدید <== مدیر و کارمندان فروشگاه
        
        3- محصولات کتگوری دارند
        
        4- محصولات تخفیف هم میتونند داشته باشند
        
        5- اضافه کردن محصول به سبد خرید - چندتا آدرس داشته باشند - بعد از انتخاب آدرس ثبت سفارش کنند. <== مشتریان
        
        6- هر سفارش چندتا محصول با تعداد متفاوت میتونه داشته باشه
        
        7- اول از همه باید در سایت ایجاد حساب کرده یا لاگین کنه و بعد ثبت سفارش <== مشتری
        
        8- دیدن و یا ادیت "وضعیت سفارش های اخیر"، تاریخچه سفارش های خود، پروفایل کاربری از طریق پنل مشتری <== مشتری
      
      
      
      
    اپ ها:
    
        1- مشتریان یا کاستومرز:
            * ویوها و مدل های مربوط به مشتری:
                ثبت نام مشتری
                ویرایش اطلاعات مشتری
                آدرس های مشتری
                اطلاعات فردی مشتری
                
            * پنل  مشتری:
                صفحات و ویو های مربوط:
                    تاریخچه سفارش ها
                    وضعیت سفارش ها
                    لیست آدرس های ثبت شده: 
                        ذخیره در دیتا بیس بصورت دقیق:
                            شهر و استان و غیره
                    حساب کاربری
                    لاگین کاربران:
                        * دو روش:
                            او تی پی کد و ارسال ایمیل (برای ذخیره سازی کد از ردیس استفاده میکنیم)
                            نام کاربری و رمز غبور
                            *** کاستوم بک اند
        
        2- محصولات یا پروداکت:
            ویوهای اصلی پروژه یا لندینگ اینجاست:
                محصول:
                    نام و برند محصول و مشخصات و موجودی انبار
                تخفیف
                کد تخفیف
                دسته بندی: 
                    به شکل درختی
        
        3- سفارش ها یا اوردرز:
            عملیات و مدل های مربوط به سفارشات:
                سفارش یا سبد خرید مشتری
                آیتم های سفارش (تعداد محصول باید در انبار موجود باشد)
                
            *** سبد خرید باید سینگل پیج باشه و با استفاده از drf
            ** خلاصه یعنی سبد خرید نباید باعث رفرش شدن پروژه بشه
            * حواست به fetch باشه
        
        4- اپ هسته یا کُر:
            چیزایی که قراره تو کل پروژه تکرار بشه میاد اینجا
            مدل های بیس
            ویوهای بیس
        
        5- اکانتس:
            شخصی سازی عنوان، لگو، و پنل ادمین جنگو
            توسعه ی مدل ادمین
            سطوح دسترسی:
                مدیرمحصولات:
                    مشاهده، ویرایش، حذف و افزودن محصولات، دسته بندی ها، تخفیف ها در سیستم
                ناظر:
                    مشاهده تمام بخش های سیستم در پنل ادمین
                اپراتور:
                    مشاهده، ویرایش، حذف و افزودن مشتری فروشگاه و آدرس هاش و سفارشات
        
        
        
        
    ** برای راحتی استفاده از کوئری ها از منجر مناسب استفاده بشه
    
    
    
    <<ما بقی چیزا>>
    
        تست نویسی با کاوریج بالای 80 درصد
        
        چند زبانه بودن
        
        گیت
        
        تمامی قسمت هایی که حذف منطقی میخوان، لاجیکال دیلیت استفاده بشه
        
        فرانت اند
        
        ورکر هوشمند:
            با استفاده از سلری، تمامی کاربرانی که بعد از گذشت 3 روز از ثبت نام هنوز حساب کاربریشون فعال نشده بطور خودکار حذف بشن
            
    
"""

# ****************************************************************************************************************************************************

""" 
    چه اپ هایی میخوام تا اینجا؟
        
        پروداکتس
        
        کُر
        
        اکانتس:
            که هم شامل مشتریان میشه هم مدیر و هم کارمندان
        
        سفارش

        بلاگ

"""

# ****************************************************************************************************************************************************

"""
    مدل های مد نظرم تا اینجا:
    
        یوزر
        
        پروداکت یا همون محصول
        
        کتگوری
        
        یه مدل بیس برای ذخیره تاریخ ها و تایم ها
        
        آیتم های داخل سفارش
        
        سبد خرید
        
        آدرس های یوزر
        
        یه مدل برای ذخیره سازی اوتیپی کد
        
        کامنت مشتری ها
        
        کد تخفیف    
        
        امتیازی که به غذا میخوان بدن
        
        و ...............................................
"""


# ****************************************************************************************************************************************************